In [1]:
import sqlite3

In [2]:
## Connect to a SQLite Database
connection=sqlite3.connect('example.db')
connection

In [3]:
cursor=connection.cursor()

In [4]:
##Create a Table
cursor.execute('''
Create Table if Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
''')

##Commit the changes
connection.commit()

In [6]:
cursor.execute('''
Select * from employees
''')

In [9]:
##Insert the data in a sqlite table
cursor.execute('''
Insert Into employees(name,age,department)
               values('Doiee',22,'Student')
''')

cursor.execute('''
Insert Into employees(name,age,department)
               values('Jini',21,'Student')
''')

cursor.execute('''
Insert Into employees(name,age,department)
               values('Bhai',1000,'Student')
''')

##Commit code
connection.commit()

In [10]:
##Query data from the table

cursor.execute('select * from employees')
rows=cursor.fetchall()

##Print the rows

for row in rows:
    print(row)

(1, 'Doiee', 22, 'Student')
(2, 'Doiee', 22, 'Student')
(3, 'Jini', 21, 'Student')
(4, 'Bhai', 1000, 'Student')
(5, 'Doiee', 22, 'Student')
(6, 'Jini', 21, 'Student')
(7, 'Bhai', 1000, 'Student')

In [11]:
##update the data in table

cursor.execute('''
UPDATE employees
Set age = 34
where name="Doiee"
''')

connection.commit()

In [12]:
##Query data from the table

cursor.execute('select * from employees')
rows=cursor.fetchall()

##Print the rows

for row in rows:
    print(row)

(1, 'Doiee', 34, 'Student')
(2, 'Doiee', 34, 'Student')
(3, 'Jini', 21, 'Student')
(4, 'Bhai', 1000, 'Student')
(5, 'Doiee', 34, 'Student')
(6, 'Jini', 21, 'Student')
(7, 'Bhai', 1000, 'Student')

In [16]:
##Delete Data from table
cursor.execute('''
Delete from employees
               where name="Doiee"
''')

connection.commit()

In [17]:
##Query data from the table

cursor.execute('select * from employees')
rows=cursor.fetchall()

##Print the rows

for row in rows:
    print(row)

(3, 'Jini', 21, 'Student')
(4, 'Bhai', 1000, 'Student')
(6, 'Jini', 21, 'Student')
(7, 'Bhai', 1000, 'Student')

In [19]:
##Working with Sales data
##Connect with a SQLite database

connection = sqlite3.connect('sales_data.db')
cursor=connection.cursor()

#Create a table for sales data

cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
    )
''')

connection.commit()

In [23]:
#INSERT data into sales table
sales_data=[
    ('1/10/10', 'Chocobar', 100, 'east'),
    ('5/10/10', 'Chocobuiscuit', 23, 'north'),
    ('10/10/10', 'Choco icecream', 335, 'south'),
    ('15/10/10', 'Chocolate', 345, 'West')
]

cursor.executemany('''
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [24]:
cursor.execute('SELECT * FROM sales')
rows= cursor.fetchall()

for row in rows:
    print(row)

(1, '1/10/10', 'Chocobar', 100, 'east')
(2, '5/10/10', 'Chocobuiscuit', 23, 'north')
(3, '10/10/10', 'Choco icecream', 335, 'south')
(4, '15/10/10', 'Chocolate', 345, 'West')
(5, '1/10/10', 'Chocobar', 100, 'east')
(6, '5/10/10', 'Chocobuiscuit', 23, 'north')
(7, '10/10/10', 'Choco icecream', 335, 'south')
(8, '15/10/10', 'Chocolate', 345, 'West')

In [25]:
##close the connection

connection.close()